# MacroModule Properties

---
The MacroModule type exposes the following members.
| Name| Description
---|---|---
| Environment|  The Macro environment.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MacroLanguageType|  The Macro language type.
| MacroManager|  The Macro manager.
| ModuleFolder|  The module folder.
| ModuleStatus|  The module status.
| Name|  The name of the module.
Top
#### Reference
MacroModule Class
Autodesk.Revit.DB.Macros Namespace